# Generate by ChatGPT

URL: https://chatgpt.com/share/67f1de17-8824-8007-87dc-e662c3969172

In [59]:
import pandas as pd
import numpy as np

data = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana', 'Eduardo', 'Fernanda', 'Gabriel'],
    'Idade': [28, np.nan, 35, 42, np.nan, 30, 25],
    'Cidade': ['São Paulo', 'Rio de Janeiro', np.nan, 'Curitiba', 'Recife', 'Fortaleza', np.nan],
    'Salario': [5000, 4500, np.nan, 7000, 5200, np.nan, 4100]
}

df = pd.DataFrame(data)

##### 1. Quantos valores nulos existem no DataFrame inteiro?

Dica: use isnull().sum().sum().

In [60]:
df.isnull().sum().sum()

np.int64(6)

##### 2. Mostre a quantidade de valores nulos por coluna.

In [61]:
df.isnull().sum()

Nome       0
Idade      2
Cidade     2
Salario    2
dtype: int64

##### 3. Liste as linhas que possuem pelo menos um valor nulo.

In [62]:
# axis 1 = verifica as linhas
# axis 0 = verifica as colunas
df.isnull().any(axis=1)


df[df.isnull().any(axis=1)]

       Nome  Idade          Cidade  Salario
1     Bruno    NaN  Rio de Janeiro   4500.0
2    Carlos   35.0             NaN      NaN
4   Eduardo    NaN          Recife   5200.0
5  Fernanda   30.0       Fortaleza      NaN
6   Gabriel   25.0             NaN   4100.0

##### 4. Remova todas as linhas que possuem ao menos um valor nulo.

In [63]:
# Remove todas as linhas que tenham valor

df.dropna()

    Nome  Idade     Cidade  Salario
0    Ana   28.0  São Paulo   5000.0
3  Diana   42.0   Curitiba   7000.0

##### 5. Remova todas as colunas que possuem pelo menos um valor nulo.

In [64]:
df.dropna(axis=1)

       Nome
0       Ana
1     Bruno
2    Carlos
3     Diana
4   Eduardo
5  Fernanda
6   Gabriel

##### 6. Substitua os valores nulos da coluna Idade pela média dessa coluna.

In [65]:
mean_column_age = df['Idade'].mean()

df['Idade'] = df['Idade'].fillna(mean_column_age)
df

       Nome  Idade          Cidade  Salario
0       Ana   28.0       São Paulo   5000.0
1     Bruno   32.0  Rio de Janeiro   4500.0
2    Carlos   35.0             NaN      NaN
3     Diana   42.0        Curitiba   7000.0
4   Eduardo   32.0          Recife   5200.0
5  Fernanda   30.0       Fortaleza      NaN
6   Gabriel   25.0             NaN   4100.0

##### 7. Substitua os valores nulos da coluna Salario pela mediana dessa coluna.

In [66]:
median_column_salary = df['Salario'].median()

df['Salario'] = df['Salario'].fillna(median_column_salary)

df

       Nome  Idade          Cidade  Salario
0       Ana   28.0       São Paulo   5000.0
1     Bruno   32.0  Rio de Janeiro   4500.0
2    Carlos   35.0             NaN   5000.0
3     Diana   42.0        Curitiba   7000.0
4   Eduardo   32.0          Recife   5200.0
5  Fernanda   30.0       Fortaleza   5000.0
6   Gabriel   25.0             NaN   4100.0

##### 8. Preencha os valores nulos da coluna Cidade com o texto "Desconhecida".

In [67]:
df['Cidade'] = df['Cidade'].fillna('Desconhecida')
df

       Nome  Idade          Cidade  Salario
0       Ana   28.0       São Paulo   5000.0
1     Bruno   32.0  Rio de Janeiro   4500.0
2    Carlos   35.0    Desconhecida   5000.0
3     Diana   42.0        Curitiba   7000.0
4   Eduardo   32.0          Recife   5200.0
5  Fernanda   30.0       Fortaleza   5000.0
6   Gabriel   25.0    Desconhecida   4100.0

##### 9. Crie uma nova coluna chamada Completos, que vale True se a linha não possui nenhum valor nulo e False caso contrário.

In [68]:
# Sinal de '~' é o mesmo que usar NOT
new_data = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana', 'Eduardo', 'Fernanda', 'Gabriel'],
    'Idade': [28, np.nan, 35, 42, np.nan, 30, 25],
    'Cidade': ['São Paulo', 'Rio de Janeiro', np.nan, 'Curitiba', 'Recife', 'Fortaleza', np.nan],
    'Salario': [5000, 4500, np.nan, 7000, 5200, np.nan, 4100]
}

new_data = pd.DataFrame(data)

new_data['Completos'] = ~new_data.isnull().any(axis=1)

new_data

       Nome  Idade          Cidade  Salario  Completos
0       Ana   28.0       São Paulo   5000.0       True
1     Bruno    NaN  Rio de Janeiro   4500.0      False
2    Carlos   35.0             NaN      NaN      False
3     Diana   42.0        Curitiba   7000.0       True
4   Eduardo    NaN          Recife   5200.0      False
5  Fernanda   30.0       Fortaleza      NaN      False
6   Gabriel   25.0             NaN   4100.0      False

##### 10. Use interpolação (interpolate) para preencher os valores nulos da coluna Idade e Salario.

In [ ]:
# Aqui a coluna 'Completos' está desatualizada, podemos atualizar com a questão 9 caso quisessemos.

new_data[['Idade','Salario']] = new_data[['Idade','Salario']].interpolate(axis=0)
new_data

       Nome  Idade          Cidade  Salario  Completos
0       Ana   28.0       São Paulo   5000.0       True
1     Bruno   31.5  Rio de Janeiro   4500.0      False
2    Carlos   35.0             NaN   5750.0      False
3     Diana   42.0        Curitiba   7000.0       True
4   Eduardo   36.0          Recife   5200.0      False
5  Fernanda   30.0       Fortaleza   4650.0      False
6   Gabriel   25.0             NaN   4100.0      False